Revit 2024 API
DuctSettings.SetPressLossCalculationServerInfo Method
 Set the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo serverInfo
)
Visual Basic
Public Sub SetPressLossCalculationServerInfo ( _
	serverInfo As MEPCalculationServerInfo _
)
Visual C++
public:
void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
Parameters
serverInfo
Type: Autodesk.Revit.DB.MEPCalculationServerInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace